# 1. Используем официальный образ Python 3.14 (Release Candidate)
# FROM — это база. Slim-версия весит меньше, так как в ней нет лишнего мусора.
FROM python:3.14-rc-slim

# 2. Запрещаем Python генерировать файлы .pyc (компилированный байт-код)
# Это экономит место и избавляет от проблем с кэшем внутри контейнера.
ENV PYTHONDONTWRITEBYTECODE=1

# 3. Отключаем буферизацию вывода (логов)
# Благодаря этому ты будешь видеть ошибки Django в терминале мгновенно.
ENV PYTHONUNBUFFERED=1

# 4. Устанавливаем системные библиотеки для работы с графикой и сборки пакетов
# apt-get — это менеджер пакетов Linux (Debian). 
# libjpeg-dev и zlib1g-dev критически важны для работы библиотеки Pillow (твои картинки).
RUN apt-get update && apt-get install -y --no-install-recommends \
    gcc \
    libjpeg-dev \
    zlib1g-dev \
    && rm -rf /var/lib/apt/lists/*

# 5. Указываем рабочую директорию
# Все последующие команды (COPY, RUN, CMD) будут выполняться именно в папке /app.
WORKDIR /app

# 6. Копируем файл со списком зависимостей с твоего Макбука в контейнер
# Мы копируем его отдельно, чтобы Docker закешировал этот шаг.
COPY requirements.txt .

# 7. Устанавливаем Python-библиотеки (Django, DRF, Pillow)
# Флаг --no-cache-dir делает образ еще легче, не сохраняя скачанные архивы.
RUN pip install --no-cache-dir -r requirements.txt

# 8. Копируем весь остальной код твоего проекта в /app
# Теперь файлы проекта (manage.py, настройки и т.д.) внутри контейнера.
COPY . .

# 9. Сообщаем Docker, что контейнер будет слушать 8000 порт
# Это чисто информативная строка для разработчика и сетевых настроек.
EXPOSE 8000

# 10. Запуск сервера Django
# 0.0.0.0:8000 — это "слушать все IP", чтобы ты мог зайти на сайт через браузер твоего Mac.
CMD ["python", "manage.py", "runserver", "0.0.0.0:8000"]
